CSI API ETABS v1
e3DFrameType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum e3DFrameType
Public Enumeration e3DFrameType
Dim instance As e3DFrameType
public enum class e3DFrameType
type e3DFrameType
Members
Member name | Value | Description
OpenFrame | 0
PerimeterFrame | 1
BeamSlab | 2
FlatPlate | 3
See Also
Reference
ETABSv1 Namespace